Documents/ФактическоеИспользованиеРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ФактическоеИспользованиеРесурсов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФактическоеИспользованиеРесурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Персонал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Персонал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Персонал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактЧасыПоТабелю</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ФактическиеЦеныНаРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФактическиеЦеныНаРесурсы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персонал</v8:Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ФактическоеИспользованиеРесурсов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьФактЧасыПоТабелюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ПерсоналПриИзменении(Элемент)
	
	ЧасыИзГрафика = ПолучитьЧасыИзГрафикаРаботы(Элементы.Персонал.ТекущиеДанные.Персонал);
	
	Если ЧасыИзГрафика <> 0 Тогда 
		Элементы.Персонал.ТекущиеДанные.Сумма = (Элементы.Персонал.ТекущиеДанные.КоличествоЧасов / ЧасыИзГрафика) * Элементы.Персонал.ТекущиеДанные.Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	
	ТекущиеДанныеСтрока = Элементы.Материалы.ТекущиеДанные;
	
	Если ТекущиеДанныеСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеСтрока.Сумма = ТекущиеДанныеСтрока.Количество * ТекущиеДанныеСтрока.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактЧасыПоТабелю(Команда)
	ЗаполнитьФактЧасыПоТабелюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПерсонал(Команда)
	ЗаполнитьЦеныПерсоналНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерсоналПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодчиненныеСтатьи(Команда)
	ЗаполнитьПодчиненныеСтатьиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПерсонал(Команда)
	Объект.Персонал.Сортировать("Персонал, Договор, СтатьяЗатрат")
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервереБезКонтекста
Функция ПолучитьЧасыИзГрафикаРаботы(Персонал)
	Попытка
		Возврат Персонал.ГрафикРаботы.КоличествоЧасовВДень;	
	Исключение
		Возврат 0;
	КонецПопытки;
КонецФункции

Процедура ЗаполнитьФактЧасыПоТабелюНаСервере()
	
	СписокПерсонала = ОбщегоНазначения.ВыгрузитьКолонку(Объект.Персонал, "Персонал", Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабельУчетаИспользованияРабочегоВремениТабель.Персонал КАК Персонал,
		|	СУММА(ТабельУчетаИспользованияРабочегоВремениТабель.ВсегоОтработанноеКоличествоЧасов) КАК ВсегоОтработанноеКоличествоЧасов
		|ИЗ
		|	Документ.ТабельУчетаИспользованияРабочегоВремени.Табель КАК ТабельУчетаИспользованияРабочегоВремениТабель
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ТабельУчетаИспользованияРабочегоВремениТабель.Ссылка.Месяц, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ)
		|	И ТабельУчетаИспользованияРабочегоВремениТабель.Персонал В(&Персонал)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабельУчетаИспользованияРабочегоВремениТабель.Персонал";
	
	Запрос.УстановитьПараметр("Месяц", Объект.Месяц);
	Запрос.УстановитьПараметр("Персонал", СписокПерсонала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Персонал", ВыборкаДетальныеЗаписи.Персонал);
		НайдСтроки = Объект.Персонал.НайтиСтроки(ПараметрыОтбора);
		Для Каждого НайдСтр Из НайдСтроки Цикл
			НайдСтр.ФактЧасыПоТабелю = ВыборкаДетальныеЗаписи.ВсегоОтработанноеКоличествоЧасов;	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПерсоналНаСервере()
	Для Каждого Стр Из Объект.Персонал Цикл
		Стр.Цена = РегистрыСведений.ФактическиеЦеныНаРесурсы.ПолучитьЦенуРесурса(КонецМесяца(Объект.Месяц), Объект.Организация, Стр.Персонал, Стр.СтатьяЗатрат, Объект.Сценарий);
		Если Стр.ФактЧасыПоТабелю <> 0 Тогда 
			Стр.Сумма = (Стр.КоличествоЧасов/ Стр.ФактЧасыПоТабелю) * Стр.Цена;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеСтатьиНаСервере()
	Для Каждого Стр Из Объект.Персонал Цикл
		Если Стр.СтатьяЗатрат.ЗависимыеСтатьиЗатрат.Количество() <> 0 Тогда
			Для Каждого СтрПодчиненная Из Стр.СтатьяЗатрат.ЗависимыеСтатьиЗатрат Цикл
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Персонал", Стр.Персонал);
				ПараметрыОтбора.Вставить("Договор", Стр.Договор);
				ПараметрыОтбора.Вставить("СтатьяЗатрат", СтрПодчиненная.СтатьяЗатрат);
				НайдСтроки = Объект.Персонал.НайтиСтроки(ПараметрыОтбора);
				Если НайдСтроки.Количество() = 0 Тогда 
					СтрНовая = Объект.Персонал.Добавить();
					ЗаполнитьЗначенияСвойств(СтрНовая,Стр);
					СтрНовая.СтатьяЗатрат = СтрПодчиненная.СтатьяЗатрат;
					СтрНовая.Цена = 0;
					СтрНовая.Сумма = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
